"**Ladies and Gentlemen, this is Jon Taffer, and it's time to SHUT IT DOWN on some fantasy football failures and celebrate the victories! I've been in this business for over 30 years, and if there's one thing I've learned, it's that success demands excellence!!! Let's dive into the chaos of Week 4 in the 'Next Year's 8 Man League' and see who's on top and who's hanging on by a thread!**\n\n**Matchup 1: Brendan's \"Rome wasn't built in Odunze\" vs. Ryan's \"Aiyuk to be a Piece of $h!t\"**\n\nBrendan came in with a fire under his seat, scoring a massive 166.1 points against Ryan's disappointing 99.5. Derrick Henry was a BEAST, racking up 35.9 points!!! What are you thinking, Ryan, letting Kyle Pitts in your starting lineup when he scored a big fat ZERO?! THIS IS UNACCEPTABLE! Meanwhile, Brendan's choice to start Nico Collins paid off big time with 33.1 points, while Ryan's bench held Rashid Shaheed's 15.7 points hostage. DO YOU UNDERSTAND WHAT YOU’VE DONE HERE, Ryan?! You left potential points on the bench. That's LOST REVENUE!!! Ryan, you're not just losing games, you're throwing away money! THIS IS FANTASY FOOTBALL 101! In the end, Brendan's team came out on top with a dominating win at 166.1 to 99.5.\n\n**Matchup 2: Brett's \"Youngh03, Big Kupps\" vs. Brian's \"Las Chubacabras\"**\n\nIn a closely fought battle, Brett pulled off a win with 116.5 points, narrowly edging out Brian's 111.9 points. Younghoe Koo was the unexpected hero with 20 points! THAT'S WHAT I'M TALKING ABOUT!!! However, Brett, leaving D'Andre Swift's 29.5 points on the bench is a MANAGEMENT FAILURE! Brian had Justin Fields lighting up the scoreboard with 31.9 points, but Keenan Allen's 4.9 points in the lineup was a letdown. WHAT ARE YOU THINKING?! Brian, Baker Mayfield's 28.8 points would have been a better QB choice. YOU LEFT MONEY ON THE TABLE!!! Brett clinched victory, 116.5 to 111.9, but both teams have room for improvement.\n\n**Matchup 3: Nick's \"Blue Dolphin\" vs. Chris's \"Three's a Stroud\"**\n\nNick's undefeated streak continues as he sunk Chris with a 149.8 to 107.0 victory. Jordan Love's 28-point performance was a game-changer, while Chris's Bijan Robinson underperformed at 11.4 points. Nick, WHY WAS D'Andre Swift on your bench with 29.5 points?! THAT'S IT! THAT'S IT! GET OUT! Chris, you left Pat Freiermuth's 16.7 points on the bench, and it's costing you! THIS IS NOT A GAME! Nick remains at the top, and Chris needs to make some lineup changes fast!\n\n**Matchup 4: Justin's \"LaPorta Della 👌🏽\" vs. Sean's \"D:cker Til She Waddles\"**\n\nThis matchup was razor-close! Justin eked out a victory over Sean with 118.8 to 118.6. Mike Evans was a standout with 23.4 points, but Sean's decision to leave Kenneth Walker III's 33.6 points on the bench was a costly mistake!!! WHAT ARE YOU THINKING?! Sean, CeeDee Lamb delivered with 23.6 points, but you need to EMBRACE THE SCIENCE of player projections! Justin's win was tight, but a win's a win, even if it's by a hair. YOU'RE GOING TO LOSE EVERYTHING if you don't make better decisions, Sean!\n\n**Matchup 5: Jack's \"Best Mahome in the Naberhood\" vs. Peej's \"Bozos Dobbed Over Circus League\"**\n\nJack felt the sting of defeat as Peej's team danced their way to a 112.6 to 110.7 victory. Malik Nabers delivered with 23.1 points for Jack, but leaving Brian Thomas Jr.'s 21.9 points on the bench was a FAILURE! Peej's bold move of starting Jayden Reed paid off with 27.1 points, outshining Tyreek Hill’s disappointing 8.2. Jack, Rashee Rice scored zero, and you didn’t see it coming? THIS IS UNACCEPTABLE! Peej keeps the undefeated streak alive, while Jack needs a TURNAROUND plan ASAP!\n\n**League Standings:**\n1. \"Blue Dolphin\" (Nick) - 4-0, 557.7 points\n2. \"Bozos Dobbed Over Circus League\" (Peej) - 4-0, 484.5 points\n3. \"Youngh03, Big Kupps\" (Brett) - 3-1, 510.9 points\n4. \"LaPorta Della 👌🏽\" (Justin) - 3-1, 480.8 points\n5. \"Best Mahome in the Naberhood\" (Jack) - 2-2, 596.3 points\n6. \"Rome wasn't built in Odunze\" (Brendan) - 1-3, 520.5 points\n7. \"D:cker Til She Waddles\" (Sean) - 1-3, 480.5 points\n8. \"Las Chubacabras\" (Brian) - 1-3, 426.2 points\n9. \"Three's a Stroud\" (Chris) - 1-3, 416.8 points\n10. \"Aiyuk to be a Piece of $h!t\" (Ryan) - 0-4, 410.6 points\n\n**That's it for this week, folks. Get your act together, or I'M DONE! I'M ABSOLUTELY DONE! Until next time, embrace the science, make smart moves, and SHUT IT DOWN on those mistakes!**\n\n**Signed, Jon Taffer**"